{
  "id": "CONTRACT-002",
  "name": "Content Source (Git-managed)",
  "relatedAdrs": ["ADR-002"],
  "status": "draft",
  "date": "2026-01-04",
  "scope": {
    "inScope": [
      "Content stored as Markdown/JSON/YAML in the repo (GitHub)",
      "Content collections for case studies, footer company logos, and profile/site settings (fields as agreed in tech spec)",
      "Integration of Git-managed content into the Astro build"
    ],
    "outOfScope": [
      "Visual presentation/layout of content (handled by framework/runtime contract)",
      "Contact form submission plumbing (handled by contact/forms contract)",
      "In-browser CMS admin UI (not provided)"
    ]
  },
  "commitments": [
    {
      "id": "collections-case-studies",
      "description": "Define and document the case studies content schema (title, slug, summary, body, technologies, role, outcomes, images, links) stored in repo content."
    },
    {
      "id": "collections-company-logos",
      "description": "Define and document the footer company logos schema (company name, logo image, optional URL, ordering) stored in repo content."
    },
    {
      "id": "collections-profile-settings",
      "description": "Define and document the profile/site settings schema (name, roles, bio, social links, nav labels, icon identifiers) stored in repo content."
    },
    {
      "id": "github-workflow",
      "description": "Document the GitHub-based editing workflow (edit Markdown in repo, optional PR/review). No CMS admin or OAuth required."
    },
    {
      "id": "astro-data-loading",
      "description": "Implement build-time data-loading utilities in Astro to read Git-managed content for home, case studies, and footer."
    }
  ],
  "deliverables": [
    {
      "id": "content-structure",
      "description": "Repository content folders/files for case studies, companies, and settings with agreed frontmatter schema."
    },
    {
      "id": "astro-content-modules",
      "description": "Astro utilities or modules exposing case studies, company logos, and profile/settings data to pages/components."
    }
  ],
  "acceptanceCriteria": {
    "admin": [
      "Content is editable via GitHub (direct commits or PRs).",
      "No reliance on external CMS admin UI."
    ],
    "contentFlow": [
      "Editing or creating a case study in repo content (agreed fields) updates the site after deployment.",
      "Editing company logos in repo content updates the footer logos on the site.",
      "Editing profile/settings in repo content updates home hero text and global nav labels/icons on next build."
    ],
    "buildIntegration": [
      "Builds succeed when new content entries are added.",
      "Malformed content causes a clear, actionable build error."
    ]
  },
  "dependenciesAndRisks": [
    "Repository permissions control who can edit content (direct commit vs PR).",
    "No CMS admin UI is provided; contributors must be comfortable editing Markdown/JSON in GitHub.",
    "Changes to content schema require coordinated updates to Astro code."
  ]
}